app/controllers/slates_controller.rb

SELECT "slates".* FROM "slates"
---
  def index
    # after user logs in, she sees HER not ALL slates. Example code will look
    # something like this:
    ## current_user is a devise method calling the currently logged in user
    ## @slates = @current_user.slates

    @slates = Slate.all

INSERT INTO "slates" ("name", "election_cycle", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Fred's choice"], ["election_cycle", "2020"], ["created_at", 2017-03-15 00:28:22 UTC], ["updated_at", 2017-03-15 00:28:22 UTC]]
---
  def create
    @slate = Slate.new(slate_params)

    if @slate.save

UPDATE "slates" SET "name" = $1, "updated_at" = $2 WHERE "slates"."id" = $3  [["name", "cool updated slate name"], ["updated_at", 2017-03-15 01:35:23 UTC], ["id", 88]]
---
  def update
    if @slate.update(slate_params)

DELETE FROM "slates" WHERE "slates"."id" = $1  [["id", 294]]
---
  def destroy
    @slate.destroy

SELECT  "slates".* FROM "slates" WHERE "slates"."id" = $1 LIMIT $2  [["id", 294], ["LIMIT", 1]]
---
    def set_slate
      @slate = Slate.find(params[:id])